{
  "architectures": [
    "ProjectorModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_projector.ProjectorConfig",
    "AutoModel": "modeling_projector.ProjectorModel"
  },
  "bias": true,
  "depth": 2,
  "hidden_act": "gelu",
  "llm_hidden_size": 4096,
  "model_type": "projector",
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "visual_hidden_size": 1024
}
